<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>数据挖掘概念与技术(原书第三版)--读书笔记 | Hello Flat2010</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x751F;&amp;#x6D3B;&amp;#x4E2D;&amp;#x4E0D;&amp;#x662F;&amp;#x7F3A;&amp;#x5C11;&amp;#x6570;&amp;#x636E;&amp;#xFF0C;&amp;#x800C;&amp;#x662F;&amp;#x7F3A;&amp;#x5C11;&amp;#x6316;&amp;#x6398;&amp;#x6570;&amp;#x636E;&amp;#x7684;&amp;#x827A;&amp;#x672F;




&amp;#x4E00;&amp;#x3001;Chapter 1&amp;">
<meta property="og:type" content="article">
<meta property="og:title" content="数据挖掘概念与技术(原书第三版)--读书笔记">
<meta property="og:url" content="http://yoursite.com/2016/11/10/数据挖掘概念与技术-原书第三版-读书笔记/index.html">
<meta property="og:site_name" content="Hello Flat2010">
<meta property="og:description" content="&amp;#x751F;&amp;#x6D3B;&amp;#x4E2D;&amp;#x4E0D;&amp;#x662F;&amp;#x7F3A;&amp;#x5C11;&amp;#x6570;&amp;#x636E;&amp;#xFF0C;&amp;#x800C;&amp;#x662F;&amp;#x7F3A;&amp;#x5C11;&amp;#x6316;&amp;#x6398;&amp;#x6570;&amp;#x636E;&amp;#x7684;&amp;#x827A;&amp;#x672F;




&amp;#x4E00;&amp;#x3001;Chapter 1&amp;">
<meta property="og:image" content="http://yoursite.com/2016/11/10/数据挖掘概念与技术-原书第三版-读书笔记/KDD步骤.png">
<meta property="og:updated_time" content="2016-11-23T15:05:18.708Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="数据挖掘概念与技术(原书第三版)--读书笔记">
<meta name="twitter:description" content="&amp;#x751F;&amp;#x6D3B;&amp;#x4E2D;&amp;#x4E0D;&amp;#x662F;&amp;#x7F3A;&amp;#x5C11;&amp;#x6570;&amp;#x636E;&amp;#xFF0C;&amp;#x800C;&amp;#x662F;&amp;#x7F3A;&amp;#x5C11;&amp;#x6316;&amp;#x6398;&amp;#x6570;&amp;#x636E;&amp;#x7684;&amp;#x827A;&amp;#x672F;




&amp;#x4E00;&amp;#x3001;Chapter 1&amp;">
<meta name="twitter:image" content="http://yoursite.com/2016/11/10/数据挖掘概念与技术-原书第三版-读书笔记/KDD步骤.png">
  
    <link rel="alternate" href="/atom.xml" title="Hello Flat2010" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">Hello Flat2010</a>
      </h1>
      
        <h2 id="subtitle-wrap">
          <a href="/" id="subtitle">Life is short, so let&#39;s make it different.</a>
        </h2>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="Search"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://yoursite.com"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-数据挖掘概念与技术-原书第三版-读书笔记" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2016/11/10/数据挖掘概念与技术-原书第三版-读书笔记/" class="article-date">
  <time datetime="2016-11-09T17:21:23.000Z" itemprop="datePublished">2016-11-10</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/读书笔记/">读书笔记</a>
  </div>

  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      数据挖掘概念与技术(原书第三版)--读书笔记
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <blockquote>
<font color="#0000FF" face="&#x5FAE;&#x8F6F;&#x96C5;&#x9ED1;" size="4">&#x751F;&#x6D3B;&#x4E2D;&#x4E0D;&#x662F;&#x7F3A;&#x5C11;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x662F;&#x7F3A;&#x5C11;&#x6316;&#x6398;&#x6570;&#x636E;&#x7684;&#x827A;&#x672F;</font>


</blockquote>
<hr>
<h4 id="&#x4E00;&#x3001;Chapter-1&#xFF08;&#x5F15;&#x8BBA;&#xFF09;"><a href="#&#x4E00;&#x3001;Chapter-1&#xFF08;&#x5F15;&#x8BBA;&#xFF09;" class="headerlink" title="&#x4E00;&#x3001;Chapter 1&#xFF08;&#x5F15;&#x8BBA;&#xFF09;"></a>&#x4E00;&#x3001;Chapter 1&#xFF08;&#x5F15;&#x8BBA;&#xFF09;</h4><h5 id="1-1-KDD&#xFF08;&#x6570;&#x636E;&#x77E5;&#x8BC6;&#x53D1;&#x73B0;&#xFF09;"><a href="#1-1-KDD&#xFF08;&#x6570;&#x636E;&#x77E5;&#x8BC6;&#x53D1;&#x73B0;&#xFF09;" class="headerlink" title="1.1 KDD&#xFF08;&#x6570;&#x636E;&#x77E5;&#x8BC6;&#x53D1;&#x73B0;&#xFF09;"></a>1.1 KDD&#xFF08;&#x6570;&#x636E;&#x77E5;&#x8BC6;&#x53D1;&#x73B0;&#xFF09;</h5><p>&#x3000;&#x3000;&#x5BF9;&#x4E8E;KDD&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x5BF9;&#x5176;&#x7406;&#x89E3;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x6709;&#x7684;&#x5C06;&#x5176;&#x89C6;&#x4E3A;DM&#x7684;&#x540C;&#x4E49;&#x8BCD;&#xFF0C;&#x6709;&#x7684;&#x4EBA;&#x5219;&#x504F;&#x5411;&#x4E8E;&#x628A;DM&#x770B;&#x505A;KDD&#x7684;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x6B65;&#x9AA4;&#x3002;&#x6839;&#x636E;&#x5B9E;&#x9645;&#x9879;&#x76EE;&#x7ECF;&#x9A8C;&#x6765;&#x770B;&#xFF0C;&#x4E2A;&#x4EBA;&#x66F4;&#x503E;&#x5411;&#x4E8E;&#x7B2C;&#x4E00;&#x79CD;&#x89C2;&#x70B9;&#xFF0C;KDD&#x5171;&#x7531;7&#x4E2A;&#x6B65;&#x9AA4;&#x7EC4;&#x6210;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;1-1&#x6240;&#x793A;&#xFF1A;<br><img src="/2016/11/10/&#x6570;&#x636E;&#x6316;&#x6398;&#x6982;&#x5FF5;&#x4E0E;&#x6280;&#x672F;-&#x539F;&#x4E66;&#x7B2C;&#x4E09;&#x7248;-&#x8BFB;&#x4E66;&#x7B14;&#x8BB0;/KDD&#x6B65;&#x9AA4;.png" alt="image"><br>&#x3000;&#x3000;<div align="center">&#x56FE;1-1 KDD&#x4E03;&#x4E2A;&#x6B65;&#x9AA4;</div><br>&#x3000;&#x3000;&#x867D;&#x7136;&#x4E0A;&#x56FE;&#x4E2D;&#x7B2C;&#x4E94;&#x6B65;&#x540D;&#x79F0;&#x4E5F;&#x79F0;&#x4E3A;&#x201C;&#x6570;&#x636E;&#x6316;&#x6398;&#x201D;&#xFF0C;&#x4F46;&#x662F;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#xFF0C;&#x8FD9;&#x91CC;&#x6240;&#x6307;&#x7684;&#x6570;&#x636E;&#x6316;&#x6398;&#x5C5E;&#x4E8E;&#x72ED;&#x4E49;&#x4E0A;&#x7684;&#xFF0C;&#x5E7F;&#x4E49;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x6316;&#x6398;&#x4E0D;&#x5E94;&#x8BE5;&#x4EC5;&#x4EC5;&#x6307;&#x5BF9;&#x5904;&#x7406;&#x597D;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x6A21;&#x5F0F;&#x7684;&#x63D0;&#x53D6;&#xFF0C;&#x8FD8;&#x5E94;&#x8BE5;&#x5305;&#x542B;&#x524D;&#x671F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x6570;&#x636E;&#x9884;&#x5904;&#x7406;&#x4EE5;&#x53CA;&#x540E;&#x671F;&#x7684;&#x53EF;&#x89C6;&#x5316;&#x5448;&#x73B0;&#xFF0C;&#x6574;&#x4E2A;&#x6D41;&#x7A0B;&#x624D;&#x6784;&#x6210;&#x5B8C;&#x6574;&#x7684;&#x201C;&#x6570;&#x636E;&#x6316;&#x6398;&#x201D;&#xFF0C;&#x800C;&#x4E0D;&#x5E94;&#x8BE5;&#x5C06;&#x8FD9;&#x4E9B;&#x8FDE;&#x8D2F;&#x7684;&#x8FC7;&#x7A0B;&#x5272;&#x88C2;&#x5F00;&#x6765;&#x3002;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x540C;&#x884C;&#x5E94;&#x8BE5;&#x90FD;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x611F;&#x609F;&#xFF0C;&#x505A;&#x6570;&#x636E;&#x6316;&#x6398;&#x4E5F;&#x597D;&#xFF0C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E5F;&#x7F62;&#xFF0C;&#x5176;&#x5B9E;&#x76F8;&#x5F53;&#x5927;&#x4E00;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x90FD;&#x4F1A;&#x8017;&#x8D39;&#x5728;&#x6570;&#x636E;&#x7684;&#x9884;&#x5904;&#x7406;&#x8FD9;&#x4E2A;&#x73AF;&#x8282;&#x3002;</p>
<font color="#FF00FF" face="&#x5FAE;&#x8F6F;&#x96C5;&#x9ED1;" size="2">&#x8BF4;&#x660E;&#xFF1A;&#x4EE5;&#x4E0A;&#x4EC5;&#x5C5E;&#x4E2A;&#x4EBA;&#x89C2;&#x70B9;&#xFF0C;&#x8BF7;&#x77E5;&#x6653;&#xFF0C;&#x800C;&#x8BE5;&#x6559;&#x6750;&#x4E2D;&#xFF08;P9&#xFF09;&#x5BF9;&#x201C;&#x6570;&#x636E;&#x6316;&#x6398;&#x201D;&#x7684;&#x5B9A;&#x4E49;&#x4E3A;&#xFF1A;<br></font><font color="#FF0000" face="&#x5FAE;&#x8F6F;&#x96C5;&#x9ED1;" size="4">&#x4ECE;&#x5927;&#x91CF;&#x6570;&#x636E;&#x4E2D;&#x6316;&#x6398;&#x6709;&#x8DA3;&#x6A21;&#x5F0F;&#x548C;&#x77E5;&#x8BC6;&#x7684;&#x8FC7;&#x7A0B;&#x3002;<br></font><font color="#003F2D" face="&#x5FAE;&#x8F6F;&#x96C5;&#x9ED1;" size="2">&#x6570;&#x636E;&#x6E90;&#x5305;&#x62EC;&#x6570;&#x636E;&#x5E93;&#x3001;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x3001;Web&#x3001;&#x5176;&#x4ED6;&#x4FE1;&#x606F;&#x5B58;&#x50A8;&#x5E93;&#x6216;&#x52A8;&#x6001;&#x5730;&#x6D41;&#x5165;&#x7CFB;&#x7EDF;&#x7684;&#x6570;&#x636E;&#x3002;</font>

<p>&#x3000;&#x3000;</p>
<h5 id="1-2-&#x53EF;&#x4EE5;&#x6316;&#x6398;&#x4EC0;&#x4E48;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;"><a href="#1-2-&#x53EF;&#x4EE5;&#x6316;&#x6398;&#x4EC0;&#x4E48;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;" class="headerlink" title="1.2 &#x53EF;&#x4EE5;&#x6316;&#x6398;&#x4EC0;&#x4E48;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;"></a>1.2 &#x53EF;&#x4EE5;&#x6316;&#x6398;&#x4EC0;&#x4E48;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;</h5><p>&#x3000;&#x3000;&#x7406;&#x8BBA;&#x4E0A;&#xFF0C;&#x6570;&#x636E;&#x6316;&#x6398;&#x9002;&#x7528;&#x4E8E;&#x4EFB;&#x4F55;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x79CD;&#x901A;&#x7528;&#x6280;&#x672F;&#x3002;&#x4F46;&#x662F;&#x5728;&#x5B9E;&#x9645;&#x751F;&#x4EA7;&#x4E2D;&#xFF0C;&#x5E94;&#x7528;&#x7684;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x6709;&#x4E09;&#x79CD;&#xFF1A;&#x6570;&#x636E;&#x5E93;&#x6570;&#x636E;&#x3001;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x6570;&#x636E;&#x4EE5;&#x53CA;&#x4E8B;&#x52A1;&#x6570;&#x636E;&#x3002;&#x5176;&#x5B83;&#x7684;&#x5219;&#x5305;&#x542B;&#x6BD4;&#x5982;&#x6D41;&#x5F0F;&#x6570;&#x636E;&#x3001;&#x5E8F;&#x5217;&#x6570;&#x636E;&#x3001;&#x56FE;&#x6216;&#x8005;&#x7F51;&#x7EDC;&#x6570;&#x636E;&#x3001;&#x7A7A;&#x95F4;&#x6570;&#x636E;&#x3001;&#x6587;&#x672C;&#x6570;&#x636E;&#x3001;&#x5F71;&#x97F3;&#x6570;&#x7801;&#x591A;&#x5A92;&#x4F53;&#x5A92;&#x4F53;&#x6570;&#x636E;&#x7B49;&#x7B49;&#x3002;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x5982;&#x6B64;&#x53D1;&#x8FBE;&#x7684;&#x4ECA;&#x5929;&#xFF0C;&#x4E8B;&#x52A1;&#x6570;&#x636E;&#x5360;&#x636E;&#x7740;&#x4E3E;&#x8DB3;&#x8F7B;&#x91CD;&#x7684;&#x5730;&#x4F4D;&#x3002;</p>
<h6 id="1-2-1-&#x6570;&#x636E;&#x5E93;&#x6570;&#x636E;"><a href="#1-2-1-&#x6570;&#x636E;&#x5E93;&#x6570;&#x636E;" class="headerlink" title="1.2.1 &#x6570;&#x636E;&#x5E93;&#x6570;&#x636E;"></a>1.2.1 &#x6570;&#x636E;&#x5E93;&#x6570;&#x636E;</h6><p>&#x3000;&#x3000;&#x8FD9;&#x7C7B;&#x6570;&#x636E;&#x4EE5;&#x4F20;&#x7EDF;&#x7684;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x6570;&#x636E;&#x4E3A;&#x4EE3;&#x8868;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x975E;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x5927;&#x884C;&#x5176;&#x9053;&#x7684;&#x4ECA;&#x5929;&#xFF0C;&#x5B83;&#x4ECD;&#x7136;&#x5360;&#x636E;&#x7740;&#x4E3B;&#x5BFC;&#x5730;&#x4F4D;&#xFF0C;&#x5C5E;&#x4E8E;&#x6570;&#x636E;&#x6316;&#x6398;&#x4E2D;&#x6700;&#x5E38;&#x89C1;&#x4E5F;&#x662F;&#x6700;&#x4E3A;&#x4E30;&#x5BCC;&#x7684;&#x4FE1;&#x606F;&#x6E90;&#x3002;&#x8FD1;&#x5E74;&#x6765;&#x968F;&#x7740;&#x201C;&#x5927;&#x6570;&#x636E;&#x201D;&#x7684;&#x70ED;&#x6F6E;&#xFF0C;&#x975E;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x5404;&#x9886;&#x98CE;&#x9A9A;&#xFF0C;&#x5927;&#x6709;&#x8981;&#x76D6;&#x8FC7;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x98CE;&#x5934;&#x7684;&#x8D8B;&#x52BF;&#x3002;</p>
<h6 id="1-2-2-&#x6570;&#x636E;&#x4ED3;&#x5E93;"><a href="#1-2-2-&#x6570;&#x636E;&#x4ED3;&#x5E93;" class="headerlink" title="1.2.2 &#x6570;&#x636E;&#x4ED3;&#x5E93;"></a>1.2.2 &#x6570;&#x636E;&#x4ED3;&#x5E93;</h6><p>&#x3000;&#x3000;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x4E66;&#x4E0A;&#x7684;&#x5B9A;&#x4E49;&#x662F;&#xFF1A;&#x4E00;&#x4E2A;&#x4ECE;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x6E90;&#x6536;&#x96C6;&#x7684;&#x4FE1;&#x606F;&#x5B58;&#x50A8;&#x5E93;&#xFF0C;&#x5B58;&#x653E;&#x5728;&#x4E00;&#x81F4;&#x7684;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x5E38;&#x9A7B;&#x7559;&#x5728;&#x5355;&#x4E2A;&#x7AD9;&#x70B9;&#x4E0A;&#x3002;&#x5178;&#x578B;&#x7684;&#x5982;&#x6709;&#x591A;&#x4E2A;&#x5206;&#x90E8;&#x7684;&#x5927;&#x578B;&#x516C;&#x53F8;&#xFF0C;&#x5B83;&#x7684;&#x6240;&#x6709;&#x4E1A;&#x52A1;&#x6570;&#x636E;&#x4F1A;&#x4ECE;&#x5404;&#x4E2A;&#x5206;&#x90E8;&#x6C47;&#x96C6;&#x5230;&#x4E00;&#x8D77;&#xFF08;&#x901A;&#x5E38;&#x662F;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF09;&#x3002;&#x9488;&#x5BF9;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x201C;&#x6570;&#x636E;&#x7ACB;&#x65B9;&#x4F53;&#x201D;(data cube)&#x5EFA;&#x6A21;&#x5904;&#x7406;&#x3002;&#x5BF9;&#x8FD9;&#x7C7B;&#x6570;&#x636E;&#x7684;&#x6DF1;&#x5165;&#x5206;&#x6790;&#x5C31;&#x6D89;&#x53CA;&#x5230;&#x201C;&#x591A;&#x7EF4;&#x6570;&#x636E;&#x6316;&#x6398;&#x201D;&#x6280;&#x672F;&#x4E86;&#x3002;</p>
<h6 id="1-2-3-&#x4E8B;&#x52A1;&#x6570;&#x636E;"><a href="#1-2-3-&#x4E8B;&#x52A1;&#x6570;&#x636E;" class="headerlink" title="1.2.3 &#x4E8B;&#x52A1;&#x6570;&#x636E;"></a>1.2.3 &#x4E8B;&#x52A1;&#x6570;&#x636E;</h6><p>&#x3000;&#x3000;&#x8FD9;&#x7C7B;&#x6570;&#x636E;&#x4EE5;&#x5178;&#x578B;&#x7684;&#x7535;&#x5546;&#x6570;&#x636E;&#x4E3A;&#x4EE3;&#x8868;&#xFF0C;&#x6BCF;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x88AB;&#x79F0;&#x4F5C;&#x4E00;&#x4E2A;&#x201C;&#x4E8B;&#x52A1;&#x201D;(transaction)&#xFF0C;&#x5B83;&#x5BF9;&#x5E94;&#x7684;&#x5B9E;&#x9645;&#x573A;&#x666F;&#x53EF;&#x80FD;&#x662F;&#x987E;&#x5BA2;&#x5728;&#x6C83;&#x5C14;&#x739B;&#x7684;&#x4E00;&#x6B21;&#x8D2D;&#x7269;&#xFF0C;&#x6216;&#x8005;&#x5728;&#x643A;&#x7A0B;&#x4E0A;&#x7684;&#x4E00;&#x6B21;&#x9152;&#x5E97;&#xFF08;&#x822A;&#x73ED;&#x3001;&#x706B;&#x8F66;&#x7968;&#xFF09;&#x7684;&#x9884;&#x5B9A;&#x7B49;&#x7B49;&#x3002;&#x8FD9;&#x7C7B;&#x6570;&#x636E;&#x662F;&#x6211;&#x4EEC;&#x201C;&#x5173;&#x8054;&#x89C4;&#x5219;&#x201D;&#x6316;&#x6398;&#x7684;&#x4E3B;&#x8981;&#x5E94;&#x7528;&#x5BF9;&#x8C61;&#x3002;&#x5176;&#x5B9E;&#x8FD9;&#x7C7B;&#x6570;&#x636E;&#x6700;&#x7EC8;&#x7684;&#x5B58;&#x50A8;&#x4E5F;&#x662F;&#x5728;&#x6570;&#x636E;&#x5E93;&#x6216;&#x8005;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x4E2D;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x53EF;&#x80FD;&#x4EE5;&#x6587;&#x672C;&#x65B9;&#x5F0F;&#x5B58;&#x50A8;&#xFF0C;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#x5728;&#x8BE5;&#x6559;&#x6750;&#x4E2D;&#x5C06;&#x5B83;&#x72EC;&#x7ACB;&#x6210;&#x4E00;&#x7C7B;&#x6570;&#x636E;&#xFF0C;&#x4E3B;&#x8981;&#x8FD8;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x7ED3;&#x6784;&#x7684;&#x7279;&#x6B8A;&#x6027;&#x4EE5;&#x53CA;&#x5176;&#x5E94;&#x7528;&#x7684;&#x5E7F;&#x6CDB;&#x6027;&#x3002;</p>
<h6 id="1-2-4-&#x5176;&#x5B83;&#x6570;&#x636E;"><a href="#1-2-4-&#x5176;&#x5B83;&#x6570;&#x636E;" class="headerlink" title="1.2.4 &#x5176;&#x5B83;&#x6570;&#x636E;"></a>1.2.4 &#x5176;&#x5B83;&#x6570;&#x636E;</h6><p>&#x3000;&#x3000;&#x5176;&#x5B83;&#x6570;&#x636E;&#x5305;&#x542B;&#x4E86;&#x4E4B;&#x524D;&#x63D0;&#x5230;&#x7684;&#x591A;&#x5A92;&#x4F53;&#x3001;&#x56FE;&#x3001;&#x6587;&#x672C;&#x7B49;&#x7B49;&#xFF0C;&#x4E66;&#x4E2D;&#x6CA1;&#x6709;&#x7528;&#x592A;&#x591A;&#x7684;&#x7BC7;&#x5E45;&#x4ECB;&#x7ECD;&#xFF0C;&#x8FD9;&#x91CC;&#x4E5F;&#x4E0D;&#x8D58;&#x8FF0;&#xFF0C;&#x4EE5;&#x540E;&#x6709;&#x673A;&#x4F1A;&#x78B0;&#x5230;&#x518D;&#x7528;&#x4E13;&#x9898;&#x5F62;&#x5F0F;&#x6765;&#x5199;&#x3002;&#x5BF9;&#x4E8E;&#x6587;&#x672C;&#x7C7B;&#x578B;&#x6570;&#x636E;&#x4E0D;&#x5F97;&#x4E0D;&#x591A;&#x8BF4;&#x4E24;&#x53E5;&#xFF0C;&#x8FD9;&#x7C7B;&#x6570;&#x636E;&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#x4E5F;&#x662F;&#x6BD4;&#x8F83;&#x5E7F;&#x6CDB;&#x7684;&#xFF0C;&#x5178;&#x578B;&#x7684;&#x5982;&#x544A;&#x8B66;&#x65E5;&#x5FD7;&#x7684;&#x6316;&#x6398;&#x3002;</p>
<p>&#x3000;&#x3000;</p>
<h5 id="1-3-&#x53EF;&#x4EE5;&#x6316;&#x6398;&#x4EC0;&#x4E48;&#x7C7B;&#x578B;&#x7684;&#x6A21;&#x5F0F;"><a href="#1-3-&#x53EF;&#x4EE5;&#x6316;&#x6398;&#x4EC0;&#x4E48;&#x7C7B;&#x578B;&#x7684;&#x6A21;&#x5F0F;" class="headerlink" title="1.3 &#x53EF;&#x4EE5;&#x6316;&#x6398;&#x4EC0;&#x4E48;&#x7C7B;&#x578B;&#x7684;&#x6A21;&#x5F0F;"></a>1.3 &#x53EF;&#x4EE5;&#x6316;&#x6398;&#x4EC0;&#x4E48;&#x7C7B;&#x578B;&#x7684;&#x6A21;&#x5F0F;</h5><p>&#x3000;&#x3000;&#x4ECB;&#x7ECD;&#x5B8C;&#x53EF;&#x4EE5;&#x6316;&#x6398;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x540E;&#xFF0C;&#x5C31;&#x8981;&#x8BF4;&#x4E00;&#x8BF4;&#x6211;&#x4EEC;&#x7684;&#x201C;&#x6A21;&#x5F0F;&#x201D;&#x4E86;&#x3002;&#x5982;&#x679C;&#x8BF4;&#x6570;&#x636E;&#x7684;&#x201C;&#x7C7B;&#x578B;&#x201D;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x8D77;&#x70B9;&#xFF0C;&#x90A3;&#x4E48;&#x6570;&#x636E;&#x201C;&#x6A21;&#x5F0F;&#x201D;&#x5219;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x7EC8;&#x70B9;&#x2014;&#x2014;&#x6240;&#x6709;&#x7684;&#x52AA;&#x529B;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x5F97;&#x5230;&#x5BF9;&#x6211;&#x4EEC;&#x6709;&#x4EF7;&#x503C;&#xFF08;&#x5373;&#x6709;&#x8DA3;&#xFF09;&#x7684;&#x201C;&#x6A21;&#x5F0F;&#x201D;&#x3002;&#x5927;&#x4F53;&#x4E0A;&#x6765;&#x8BB2;&#xFF0C;&#x9488;&#x5BF9;&#x8FD9;&#x4E9B;&#x201C;&#x6A21;&#x5F0F;&#x201D;&#x7684;&#x6316;&#x6398;&#x4EFB;&#x52A1;&#xFF0C;&#x53EF;&#x4EE5;&#x5206;&#x6210;&#x4E24;&#x5927;&#x7C7B;&#xFF1A;&#x63CF;&#x8FF0;&#x6027;(descriptive)&#x548C;&#x9884;&#x6D4B;&#x6027;(predictive)&#x3002;&#x524D;&#x8005;&#x83B7;&#x5F97;&#x6307;&#x5B9A;&#x6570;&#x636E;&#x7684;&#x201C;&#x753B;&#x50CF;&#x201D;&#xFF0C;&#x540E;&#x8005;&#x63D0;&#x4F9B;&#x672A;&#x6765;&#x6570;&#x636E;&#x7684;&#x9884;&#x6D4B;&#x3002;&#x8981;&#x83B7;&#x5F97;&#x8FD9;&#x4E9B;&#x6709;&#x8DA3;&#x7684;&#x201C;&#x6A21;&#x5F0F;&#x201D;&#x7684;&#x9014;&#x5F84;&#x5219;&#x662F;&#x201C;&#x6570;&#x636E;&#x6316;&#x6398;&#x529F;&#x80FD;&#x201D;&#xFF0C;&#x4E0B;&#x9762;&#x5BF9;&#x5E38;&#x7528;&#x7684;&#x6316;&#x6398;&#x529F;&#x80FD;&#x53CA;&#x5176;&#x5BF9;&#x5E94;&#x53EF;&#x53D1;&#x73B0;&#x7684;&#x6A21;&#x5F0F;&#x7C7B;&#x578B;&#x5206;&#x522B;&#x4ECB;&#x7ECD;&#x3002;</p>
<h6 id="1-3-1-&#x7279;&#x5F81;&#x5316;&#x548C;&#x533A;&#x5206;"><a href="#1-3-1-&#x7279;&#x5F81;&#x5316;&#x548C;&#x533A;&#x5206;" class="headerlink" title="1.3.1 &#x7279;&#x5F81;&#x5316;&#x548C;&#x533A;&#x5206;"></a>1.3.1 &#x7279;&#x5F81;&#x5316;&#x548C;&#x533A;&#x5206;</h6><p>&#x3000;&#x3000;&#x6570;&#x636E;&#x7279;&#x5F81;&#x5316;(data characterization)&#x548C;&#x6570;&#x636E;&#x533A;&#x5206;(data discrimination)&#x8FD9;&#x4E24;&#x4E2A;&#x672F;&#x8BED;&#x542C;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x62D7;&#x53E3;&#xFF0C;&#x8BA9;&#x4EBA;&#x4E0D;&#x89E3;&#x5176;&#x610F;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x7528;&#x516D;&#x4E2A;&#x5B57;&#x5C31;&#x53EF;&#x4EE5;&#x6982;&#x62EC;&#x4E86;&#xFF1A;&#x627E;&#x5171;&#x6027;&#x3001;&#x5BFB;&#x5DEE;&#x5F02;&#x3002;&#x6570;&#x636E;&#x6316;&#x6398;&#x867D;&#x7136;&#x56CA;&#x62EC;&#x4E86;&#x4F17;&#x591A;&#x8BA9;&#x4EBA;&#x53F9;&#x4E3A;&#x89C2;&#x6B62;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4E0D;&#x540C;&#x4E8E;&#x7406;&#x8BBA;&#x6570;&#x5B66;&#xFF0C;&#x5B83;&#x6709;&#x7740;&#x6DF1;&#x539A;&#x7684;&#x5E94;&#x7528;&#x80CC;&#x666F;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x7684;&#x6761;&#x6761;&#x6846;&#x6846;&#x90FD;&#x5BF9;&#x5E94;&#x7740;&#x5B9E;&#x9645;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x6570;&#x636E;&#x7279;&#x5F81;&#x5316;&#x76EE;&#x7684;&#x5C31;&#x5728;&#x4E8E;&#x63D0;&#x9AD8;&#x201C;&#x8986;&#x76D6;&#x7387;&#x201D;&#xFF0C;&#x800C;&#x6570;&#x636E;&#x533A;&#x5206;&#x5219;&#x5728;&#x4E8E;&#x63D0;&#x9AD8;&#x201C;&#x51C6;&#x786E;&#x7387;&#x201D;&#x3002;&#x5728;&#x4F20;&#x7EDF;&#x7684;&#x6570;&#x636E;&#x5206;&#x6790;&#x9886;&#x57DF;&#xFF0C;&#x8FD9;&#x4E24;&#x8005;&#x5F80;&#x5F80;&#x662F;&#x4E00;&#x5BF9;&#x77DB;&#x76FE;&#x4F53;&#xFF0C;&#x7136;&#x800C;&#x5B83;&#x4EEC;&#x5374;&#x88AB;&#x201C;&#x5927;&#x6570;&#x636E;&#x201D;&#x5DE7;&#x5999;&#x7684;&#x6574;&#x5408;&#x8D77;&#x6765;&#x4E86;&#x3002;&#x4EE5;&#x5E7F;&#x544A;&#x4E1A;&#x52A1;&#x4E3A;&#x4F8B;&#xFF0C;&#x201C;&#x5927;&#x6570;&#x636E;&#x201D;&#x4E4B;&#x524D;&#x7684;&#x65F6;&#x4EE3;&#xFF0C;&#x4E3A;&#x4E86;&#x4E0D;&#x9519;&#x8FC7;&#x4EFB;&#x4F55;&#x4E00;&#x4F4D;&#x6F5C;&#x5728;&#x7684;&#x7528;&#x6237;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x5E7F;&#x544A;&#x5546;&#x90FD;&#x662F;&#x91C7;&#x53D6;&#x5927;&#x5305;&#x56F4;&#x7B56;&#x7565;&#xFF0C;&#x5F3A;&#x8C03;&#x201C;&#x8986;&#x76D6;&#x7387;&#x201D;&#x3002;&#x800C;&#x201C;&#x5927;&#x6570;&#x636E;&#x201D;&#x65F6;&#x4EE3;&#x7684;&#x4ECA;&#x5929;&#xFF0C;&#x5219;&#x8D8A;&#x6765;&#x8D8A;&#x5F3A;&#x8C03;&#x201C;&#x51C6;&#x786E;&#x7387;&#x201D;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x5F3A;&#x8C03;&#x201C;&#x7CBE;&#x51C6;&#x8425;&#x9500;&#x201D;&#x548C;&#x201C;&#x4E2A;&#x6027;&#x5316;&#x670D;&#x52A1;&#x201D;&#xFF0C;&#x8FD9;&#x6837;&#x770B;&#x4F3C;&#x964D;&#x4F4E;&#x4E86;&#x8986;&#x76D6;&#x7387;&#xFF0C;&#x5374;&#x53CD;&#x800C;&#x95F4;&#x63A5;&#x7684;&#x63D0;&#x9AD8;&#x4E86;&#x7528;&#x6237;&#x7684;&#x201C;&#x8986;&#x76D6;&#x7387;&#x201D;&#x3002;<br>&#x3000;&#x3000;&#x6570;&#x636E;&#x7279;&#x5F81;&#x5316;&#x7684;&#x8F93;&#x51FA;&#x6A21;&#x5F0F;&#x5305;&#x62EC;&#x4E86;&#xFF1A;&#x997C;&#x56FE;&#x3001;&#x6761;&#x56FE;&#x3001;&#x66F2;&#x7EBF;&#x3001;&#x591A;&#x7EF4;&#x6570;&#x636E;&#x7ACB;&#x65B9;&#x4F53;&#x3001;&#x591A;&#x7EF4;&#x8868;&#x7B49;&#x7B49;&#x8FD9;&#x4E9B;&#x62BD;&#x8C61;&#x5C42;&#x6B21;&#x8F83;&#x9AD8;&#x7684;&#x6A21;&#x5F0F;&#x3002;<br>&#x3000;&#x3000;&#x6570;&#x636E;&#x533A;&#x5206;&#x7684;&#x8F93;&#x51FA;&#x5219;&#x662F;&#x66F4;&#x4E3A;&#x5177;&#x4F53;&#x7684;&#x7279;&#x5F81;&#x63CF;&#x8FF0;&#xFF0C;&#x5B83;&#x5305;&#x62EC;&#x4E86;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x6027;&#x7684;&#x5EA6;&#x91CF;&#x3002;</p>
<h6 id="1-3-2-&#x9891;&#x7E41;&#x6A21;&#x5F0F;&#x6316;&#x6398;&#x53CA;&#x5173;&#x8054;&#x5206;&#x6790;"><a href="#1-3-2-&#x9891;&#x7E41;&#x6A21;&#x5F0F;&#x6316;&#x6398;&#x53CA;&#x5173;&#x8054;&#x5206;&#x6790;" class="headerlink" title="1.3.2 &#x9891;&#x7E41;&#x6A21;&#x5F0F;&#x6316;&#x6398;&#x53CA;&#x5173;&#x8054;&#x5206;&#x6790;"></a>1.3.2 &#x9891;&#x7E41;&#x6A21;&#x5F0F;&#x6316;&#x6398;&#x53CA;&#x5173;&#x8054;&#x5206;&#x6790;</h6><p>&#x3000;&#x3000;&#x9891;&#x7E41;&#x6A21;&#x5F0F;(frequent pattern)&#x6316;&#x6398;&#x673A;&#x5173;&#x8054;&#x5206;&#x6790;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x76F8;&#x5173;&#x5173;&#x7CFB;&#x800C;&#x975E;&#x56E0;&#x679C;&#x5173;&#x7CFB;&#x7684;&#x5206;&#x6790;&#xFF0C;&#x4F20;&#x7EDF;&#x7684;&#x6570;&#x636E;&#x5206;&#x6790;&#x65B9;&#x5F0F;&#x662F;&#x201C;&#x56E0;&#x679C;&#x5206;&#x6790;&#x201D;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x9002;&#x7528;&#x4E8E;&#x6570;&#x636E;&#x96C6;&#x8F83;&#x5C0F;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x5F53;&#x6570;&#x636E;&#x96C6;&#x8F83;&#x5927;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x8FD8;&#x662F;&#x6CBF;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x5176;&#x6210;&#x672C;&#x662F;&#x65E0;&#x6CD5;&#x4F30;&#x91CF;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x201C;&#x76F8;&#x5173;&#x5206;&#x6790;&#x201D;&#x5C31;&#x5E94;&#x8FD0;&#x800C;&#x751F;&#x4E86;&#xFF0C;&#x201C;&#x5173;&#x8054;&#x5206;&#x6790;&#x201D;&#x65B9;&#x6CD5;&#x8BA9;&#x6211;&#x4EEC;&#x5728;&#x9762;&#x5BF9;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x96C6;&#x65F6;&#xFF0C;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x3001;&#x51C6;&#x786E;&#x7684;&#x5206;&#x6790;&#x51FA;&#x90A3;&#x4E9B;&#x770B;&#x4F3C;&#x65E0;&#x5173;&#x800C;&#x5B9E;&#x9645;&#x4E0A;&#x5374;&#x7D27;&#x5BC6;&#x8054;&#x7CFB;&#x7684;&#x76F8;&#x5173;&#x56E0;&#x7D20;&#x3002;&#x201C;&#x56E0;&#x679C;&#x5206;&#x6790;&#x201D;&#x8981;&#x6C42;&#x6570;&#x636E;&#x4F7F;&#x7528;&#x8005;&#x5177;&#x6709;&#x76F8;&#x5173;&#x7684;&#x4E13;&#x4E1A;&#x80CC;&#x666F;&#x53CA;&#x4ECE;&#x4E1A;&#x7ECF;&#x9A8C;&#xFF0C;&#x800C;&#x201C;&#x76F8;&#x5173;&#x5206;&#x6790;&#x201D;&#x5219;&#x6CA1;&#x6709;&#x8FD9;&#x79CD;&#x9650;&#x5236;&#x3002;<br>&#x3000;&#x3000;&#x9891;&#x7E41;&#x6A21;&#x5F0F;&#x53CA;&#x5173;&#x8054;&#x5206;&#x6790;&#x7684;&#x8F93;&#x51FA;&#x5305;&#x62EC;&#x9891;&#x7E41;&#x9879;&#x96C6;&#x3001;&#x9891;&#x7E41;&#x5E8F;&#x5217;&#x3001;&#x5173;&#x8054;&#x89C4;&#x5219;&#x7B49;&#x3002;</p>
<h6 id="1-3-3-&#x5206;&#x7C7B;&#x4E0E;&#x56DE;&#x5F52;"><a href="#1-3-3-&#x5206;&#x7C7B;&#x4E0E;&#x56DE;&#x5F52;" class="headerlink" title="1.3.3 &#x5206;&#x7C7B;&#x4E0E;&#x56DE;&#x5F52;"></a>1.3.3 &#x5206;&#x7C7B;&#x4E0E;&#x56DE;&#x5F52;</h6><p>&#x3000;&#x3000;&#x76F8;&#x4FE1;&#x63A5;&#x89E6;&#x8FC7;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x4EBA;&#x5BF9;&#x5206;&#x7C7B;(classification)&#x4E0E;&#x56DE;&#x5F52;(regression)&#x8FD9;&#x4E24;&#x4E2A;&#x8BCD;&#x5E94;&#x8BE5;&#x4E0D;&#x4F1A;&#x964C;&#x751F;&#xFF0C;&#x8FD9;&#x4E24;&#x79CD;&#x6280;&#x672F;&#x5728;&#x6211;&#x4EEC;&#x5B9E;&#x9645;&#x751F;&#x4EA7;&#x751F;&#x6D3B;&#x4E2D;&#x8FD0;&#x7528;&#x5E7F;&#x6CDB;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x7528;&#x6765;&#x505A;&#x4E00;&#x4E9B;&#x9884;&#x6D4B;&#x3002;&#x5206;&#x7C7B;&#x4E3B;&#x8981;&#x662F;&#x7528;&#x4E8E;&#x7C7B;&#x6807;&#x7B7E;&#x4E3A;&#x79BB;&#x6563;&#x578B;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x56DE;&#x5F52;&#x5219;&#x7528;&#x4E8E;&#x6570;&#x503C;&#x578B;&#xFF08;&#x8FDE;&#x7EED;&#xFF09;&#x7684;&#x6570;&#x636E;&#x3002;<br>&#x3000;&#x3000;&#x5206;&#x7C7B;&#x548C;&#x56DE;&#x5F52;&#x7684;&#x8F93;&#x51FA;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x8BAD;&#x7EC3;&#x597D;&#x7684;&#x6A21;&#x578B;&#x3002;</p>
<h6 id="1-3-4-&#x805A;&#x7C7B;"><a href="#1-3-4-&#x805A;&#x7C7B;" class="headerlink" title="1.3.4 &#x805A;&#x7C7B;"></a>1.3.4 &#x805A;&#x7C7B;</h6><p>&#x3000;&#x3000;&#x540C;&#x5206;&#x7C7B;&#x548C;&#x56DE;&#x5F52;&#x4E00;&#x6837;&#xFF0C;&#x805A;&#x7C7B;(clustering)&#x5728;&#x6211;&#x4EEC;&#x5B9E;&#x9645;&#x751F;&#x4EA7;&#x751F;&#x6D3B;&#x4E2D;&#x4E5F;&#x662F;&#x8FD0;&#x7528;&#x5E7F;&#x6CDB;&#x3002;&#x805A;&#x7C7B;&#x548C;&#x5206;&#x7C7B;&#x3001;&#x56DE;&#x5F52;&#x7684;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xFF0C;&#x5B83;&#x5E76;&#x4E0D;&#x8981;&#x6C42;&#x4E8B;&#x5148;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x6807;&#x5B9A;&#xFF08;&#x6807;&#x8BB0;&#xFF09;&#x3002;&#x5B9E;&#x9645;&#x4E2D;&#x805A;&#x7C7B;&#x548C;&#x5206;&#x7C7B;&#x7ECF;&#x5E38;&#x4F1A;&#x4EA4;&#x4E92;&#x4F7F;&#x7528;&#x3002;<br>&#x3000;&#x3000;&#x805A;&#x7C7B;&#x7684;&#x8F93;&#x51FA;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x8BAD;&#x7EC3;&#x597D;&#x7684;&#x6A21;&#x578B;&#x3002;</p>
<h6 id="1-3-5-&#x79BB;&#x7FA4;&#x70B9;&#x5206;&#x6790;"><a href="#1-3-5-&#x79BB;&#x7FA4;&#x70B9;&#x5206;&#x6790;" class="headerlink" title="1.3.5 &#x79BB;&#x7FA4;&#x70B9;&#x5206;&#x6790;"></a>1.3.5 &#x79BB;&#x7FA4;&#x70B9;&#x5206;&#x6790;</h6><p>&#x3000;&#x3000;&#x901A;&#x5E38;&#x6765;&#x8BF4;&#xFF0C;&#x79BB;&#x7FA4;&#x70B9;&#x610F;&#x5473;&#x7740;&#x566A;&#x58F0;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x79BB;&#x7FA4;&#x70B9;&#xFF0C;&#x5B83;&#x4EEC;&#x5374;&#x6697;&#x793A;&#x4E86;&#x4E00;&#x4E9B;&#x7F55;&#x89C1;&#x7684;&#x4E8B;&#x4EF6;&#x6216;&#x7A00;&#x6709;&#x7684;&#x6A21;&#x5F0F;&#x3002;&#x4E5F;&#x56E0;&#x6B64;&#x9488;&#x5BF9;&#x79BB;&#x7FA4;&#x70B9;&#x7684;&#x6316;&#x6398;&#x5206;&#x6790;&#xFF0C;&#x6211;&#x4EEC;&#x5E38;&#x79F0;&#x4E3A;&#x5F02;&#x5E38;&#x6316;&#x6398;&#x3002;<br>&#x3000;&#x3000;&#x79BB;&#x7FA4;&#x70B9;&#x5206;&#x6790;&#x7684;&#x8F93;&#x51FA;&#x5305;&#x62EC;&#x7A00;&#x6709;&#x6A21;&#x5F0F;&#x3001;&#x7A00;&#x6709;&#x4E8B;&#x4EF6;&#x7B49;&#x7B49;&#x3002;</p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://yoursite.com/2016/11/10/数据挖掘概念与技术-原书第三版-读书笔记/" data-id="ciww1v51m000laoujjmy4n5mp" class="article-share-link">Share</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/数据挖掘，读书笔记，DataMine，JiaWei-Han/">数据挖掘，读书笔记，DataMine，JiaWei Han</a></li></ul>

    </footer>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/11/13/Python学习手册-读书笔记/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          Python学习手册（第三版）--读书笔记
        
      </div>
    </a>
  
  
    <a href="/2016/11/06/git-github-hexo在Win7-X64上搭建个人博客/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">Git+Github+Hexo在Win7_X64上搭建个人博客</div>
    </a>
  
</nav>

  
</article>

</section>
        
          <aside id="sidebar">
  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Categories</h3>
    <div class="widget">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/Linux/">Linux</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/小技术/">小技术</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/技巧总结/">技巧总结</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/日常技巧总结/">日常技巧总结</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/读书笔记/">读书笔记</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Tags</h3>
    <div class="widget">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/Git/">Git</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Github-Pages/">Github_Pages</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Hexo/">Hexo</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Netfilter-Iptables-Linux/">Netfilter Iptables Linux</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Oracle-11g-Ubuntu14-04-数据库安装/">Oracle_11g Ubuntu14.04 数据库安装</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Python-第三版/">Python 第三版</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Python-算法-高效率-Magnus-Lie-Hetland/">Python 算法 高效率 Magnus Lie Hetland</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Win7-X64-python27-pcapy/">Win7_X64 python27 pcapy</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Wireshark-抓包-HTTP会话保存/">Wireshark 抓包 HTTP会话保存</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/个人博客/">个人博客</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/数据挖掘，读书笔记，DataMine，JiaWei-Han/">数据挖掘，读书笔记，DataMine，JiaWei Han</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Tag Cloud</h3>
    <div class="widget tagcloud">
      <a href="/tags/Git/" style="font-size: 10px;">Git</a> <a href="/tags/Github-Pages/" style="font-size: 10px;">Github_Pages</a> <a href="/tags/Hexo/" style="font-size: 10px;">Hexo</a> <a href="/tags/Netfilter-Iptables-Linux/" style="font-size: 10px;">Netfilter Iptables Linux</a> <a href="/tags/Oracle-11g-Ubuntu14-04-数据库安装/" style="font-size: 10px;">Oracle_11g Ubuntu14.04 数据库安装</a> <a href="/tags/Python-第三版/" style="font-size: 10px;">Python 第三版</a> <a href="/tags/Python-算法-高效率-Magnus-Lie-Hetland/" style="font-size: 10px;">Python 算法 高效率 Magnus Lie Hetland</a> <a href="/tags/Win7-X64-python27-pcapy/" style="font-size: 10px;">Win7_X64 python27 pcapy</a> <a href="/tags/Wireshark-抓包-HTTP会话保存/" style="font-size: 10px;">Wireshark 抓包 HTTP会话保存</a> <a href="/tags/个人博客/" style="font-size: 10px;">个人博客</a> <a href="/tags/数据挖掘，读书笔记，DataMine，JiaWei-Han/" style="font-size: 10px;">数据挖掘，读书笔记，DataMine，JiaWei Han</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Archives</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/12/">December 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/11/">November 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/08/">August 2016</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Recent Posts</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2016/12/19/Netfilter解读系列之一-简介/">Netfilter解读系列之一：简介</a>
          </li>
        
          <li>
            <a href="/2016/12/19/hello-world/">Hello World</a>
          </li>
        
          <li>
            <a href="/2016/12/15/Win7-X64下python27安装pcapy/">Win7_X64下python27安装pcapy</a>
          </li>
        
          <li>
            <a href="/2016/12/11/Python高效率技巧总结/">Python算法教程笔记</a>
          </li>
        
          <li>
            <a href="/2016/11/18/Wireshark抓包提取图片（视频、音频、文件等）/">Wireshark抓包提取图片（视频、音频、文件等）</a>
          </li>
        
      </ul>
    </div>
  </div>

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2016 Jineney<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a>
    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>